app/controllers/event_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
---
  def view
    @event_id = params['id']
    @event = Event.find(@event_id)